#include <iostream>
using namespace std;

int main(){
    double ការចំណាយ;
    int គីឡូចាស់, គិឡូថ្មី ,គីឡូដែលបានប្រើប្រាស់;
    ណាណា:
    system("cls");
    cout << "បញ្ចូលគីឡូចាស់     : "; cin >> គីឡូចាស់;
    cout << "បញ្ចូលគីឡូថ្មី​​​        : "; cin >> គិឡូថ្មី;
    if(គីឡូចាស់ <= គិឡូថ្មី){
        cout << "ឆ្កួតទេហី!";
        system("pause");
        goto ណាណា;
    }else {
        គីឡូដែលបានប្រើប្រាស់ = គីឡូចាស់ - គិឡូថ្មី;
        if(គីឡូដែលបានប្រើប្រាស់ < 100)
            ការចំណាយ = គីឡូដែលបានប្រើប្រាស់ * 100;
        else if(គីឡូដែលបានប្រើប្រាស់ >=100 && គីឡូដែលបានប្រើប្រាស់ <=200)
            ការចំណាយ = (100 * 600) + (គីឡូដែលបានប្រើប្រាស់ - 100) * 800;
        else
            ការចំណាយ = (100 * 600) + (100 * 800) + (គីឡូដែលបានប្រើប្រាស់ - 200) * 1000;
        cout << "\nការប្រើប្រាស់ = " << គីឡូដែលបានប្រើប្រាស់ << " គីឡូវ៉ាត់";
        cout << "\nការចំណាយ  = " << ការចំណាយ << " រៀល\n";
        system("pause");
        goto ណាណា;
    }
    return 0;
}
